<!-- terraform cdk action for options with hash d8d7653347480fb032d8dce438504479 -->
### ✅ Successfully applied Terraform CDK Stack 'maestro-dotnet'



<details><summary>Show Run</summary>

```shell
/home/runner/work/maestro-media-dotnet/maestro-media-dotnet/src/Maestro.Deploy.Aws/MainStack.cs(140,32): warning CS8604: Possible null reference argument for parameter 'value' in 'void Dictionary<string, string>.Add(string key, string value)'. [/home/runner/work/maestro-media-dotnet/maestro-media-dotnet/src/Maestro.Deploy.Aws/Maestro.Deploy.Aws.csproj]

/home/runner/work/maestro-media-dotnet/maestro-media-dotnet/src/Maestro.Deploy.Aws/MainStack.cs(141,39): warning CS8604: Possible null reference argument for parameter 'value' in 'void Dictionary<string, string>.Add(string key, string value)'. [/home/runner/work/maestro-media-dotnet/maestro-media-dotnet/src/Maestro.Deploy.Aws/Maestro.Deploy.Aws.csproj]
/home/runner/work/maestro-media-dotnet/maestro-media-dotnet/src/Maestro.Deploy.Aws/MainStack.cs(142,39): warning CS8604: Possible null reference argument for parameter 'value' in 'void Dictionary<string, string>.Add(string key, string value)'. [/home/runner/work/maestro-media-dotnet/maestro-media-dotnet/src/Maestro.Deploy.Aws/Maestro.Deploy.Aws.csproj]

App synth complete

maestro-dotnet
maestro-dotnet  Initializing the backend...
maestro-dotnet  Successfully configured the backend "s3"! Terraform will automatically
                use this backend unless the backend configuration changes.
maestro-dotnet  Initializing provider plugins...
                - Finding hashicorp/aws versions matching "5.38.0"...
maestro-dotnet  - Installing hashicorp/aws v5.38.0...
maestro-dotnet  - Installed hashicorp/aws v5.38.0 (signed by HashiCorp)

                Terraform has created a lock file .terraform.lock.hcl to record the provider
                selections it made above. Include this file in your version control repository
                so that Terraform can guarantee to make the same selections by default when
                you run "terraform init" in the future.
maestro-dotnet  Terraform has been successfully initialized!

                You may now begin working with Terraform. Try running "terraform plan" to see
                any changes that are required for your infrastructure. All Terraform commands
                should now work.

                If you ever set or change modules or backend configuration for Terraform,
                rerun this command to reinitialize your working directory. If you forget, other
                commands will detect it and remind you to do so if necessary.
maestro-dotnet  - Fetching hashicorp/aws 5.38.0 for linux_amd64...
maestro-dotnet  - Retrieved hashicorp/aws 5.38.0 for linux_amd64 (signed by HashiCorp)
                - Obtained hashicorp/aws checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
maestro-dotnet  Success! Terraform has validated the lock file and found no need for changes.
maestro-dotnet  aws_iam_role.maestro-web-role (maestro-web-role): Refreshing state... [id=maestro-web-role]
maestro-dotnet  aws_sqs_queue.dlq (dlq): Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/990455710365/maestro-event-dlq.fifo]
                aws_s3_bucket.maestro-lambda-deploys (maestro-lambda-deploys): Refreshing state... [id=maestro-lambda-deploys]
maestro-dotnet  aws_sqs_queue.event-queue (event-queue): Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/990455710365/maestro-event-queue.fifo]
maestro-dotnet  aws_s3_object.maestro-lambda-deploy-web (maestro-lambda-deploy-web): Refreshing state... [id=maestro-web-deploy-638399803469208326.zip]
maestro-dotnet  aws_s3_object.maestro-lambda-deploy-events (maestro-lambda-deploy-events): Refreshing state... [id=maestro-events-deploy-638399803469449642.zip]
maestro-dotnet  aws_lambda_function.maestro-events-dotnet-lambda (maestro-events-dotnet-lambda): Refreshing state... [id=maestro-event-dotnet-lambda]
maestro-dotnet  aws_lambda_function.maestro-web-dotnet (maestro-web-dotnet): Refreshing state... [id=maestro-web-dotnet-lambda]
maestro-dotnet  aws_lambda_event_source_mapping.maestro-events-dotnet (maestro-events-dotnet): Refreshing state... [id=f5c5c6e4-3cb8-4f1b-86e2-6fe2b2a5df30]
maestro-dotnet  Terraform used the selected providers to generate the following execution plan.
                Resource actions are indicated with the following symbols:
                  ~ update in-place
                -/+ destroy and then create replacement

                Terraform will perform the following actions:
maestro-dotnet  # aws_lambda_function.maestro-events-dotnet-lambda (maestro-events-dotnet-lambda) will be updated in-place
                  ~ resource "aws_lambda_function" "maestro-events-dotnet-lambda" {
                        id                             = "maestro-event-dotnet-lambda"
                      ~ last_modified                  = "2024-01-04T15:52:43.000+0000" -> (known after apply)
                      ~ runtime                        = "dotnet6" -> "dotnet8"
                      ~ s3_key                         = "maestro-events-deploy-638399803469449642.zip" -> "maestro-events-deploy-638443112933968027.zip"
                        tags                           = {}
                        # (20 unchanged attributes hidden)

                        # (4 unchanged blocks hidden)
                    }

                  # aws_lambda_function.maestro-web-dotnet (maestro-web-dotnet) will be updated in-place
                  ~ resource "aws_lambda_function" "maestro-web-dotnet" {
                        id                             = "maestro-web-dotnet-lambda"
                      ~ last_modified                  = "2024-01-04T15:52:43.000+0000" -> (known after apply)
                      ~ runtime                        = "dotnet6" -> "dotnet8"
                      ~ s3_key                         = "maestro-web-deploy-638399803469208326.zip" -> "maestro-web-deploy-638443112933715623.zip"
                        tags                           = {}
                        # (20 unchanged attributes hidden)

                        # (4 unchanged blocks hidden)
                    }

                  # aws_s3_object.maestro-lambda-deploy-events (maestro-lambda-deploy-events) must be replaced
                -/+ resource "aws_s3_object" "maestro-lambda-deploy-events" {
                      + acl                    = (known after apply)
                      ~ bucket_key_enabled     = false -> (known after apply)
                      + checksum_crc32         = (known after apply)
                      + checksum_crc32c        = (known after apply)
                      + checksum_sha1          = (known after apply)
                      + checksum_sha256        = (known after apply)
                      ~ content_type           = "binary/octet-stream" -> (known after apply)
                      ~ etag                   = "29a31d051a9d4756623c4e7481f8e84b-3" -> (known after apply)
                      ~ id                     = "maestro-events-deploy-638399803469449642.zip" -> (known after apply)
                      ~ key                    = "maestro-events-deploy-638399803469449642.zip" -> "maestro-events-deploy-638443112933968027.zip" # forces replacement
                      + kms_key_id             = (known after apply)
                      - metadata               = {} -> null
                      ~ server_side_encryption = "AES256" -> (known after apply)
                      ~ storage_class          = "STANDARD" -> (known after apply)
                      - tags                   = {} -> null
                      ~ tags_all               = {} -> (known after apply)
                      + version_id             = (known after apply)
                        # (3 unchanged attributes hidden)
                    }

                  # aws_s3_object.maestro-lambda-deploy-web (maestro-lambda-deploy-web) must be replaced
                -/+ resource "aws_s3_object" "maestro-lambda-deploy-web" {
                      + acl                    = (known after apply)
                      ~ bucket_key_enabled     = false -> (known after apply)
                      + checksum_crc32         = (known after apply)
                      + checksum_crc32c        = (known after apply)
                      + checksum_sha1          = (known after apply)
                      + checksum_sha256        = (known after apply)
                      ~ content_type           = "application/octet-stream" -> (known after apply)
                      ~ etag                   = "3cdcaea98da78c32b1343a650121a1c1" -> (known after apply)
                      ~ id                     = "maestro-web-deploy-638399803469208326.zip" -> (known after apply)
                      ~ key                    = "maestro-web-deploy-638399803469208326.zip" -> "maestro-web-deploy-638443112933715623.zip" # forces replacement
                      + kms_key_id             = (known after apply)
                      - metadata               = {} -> null
                      ~ server_side_encryption = "AES256" -> (known after apply)
                      ~ storage_class          = "STANDARD" -> (known after apply)
                      - tags                   = {} -> null
                      ~ tags_all               = {} -> (known after apply)
                      + version_id             = (known after apply)
                        # (3 unchanged attributes hidden)
                    }

                Plan: 2 to add, 2 to change, 2 to destroy.
maestro-dotnet  aws_s3_object.maestro-lambda-deploy-events (maestro-lambda-deploy-events): Destroying... [id=maestro-events-deploy-638399803469449642.zip]
                aws_s3_object.maestro-lambda-deploy-web (maestro-lambda-deploy-web): Destroying... [id=maestro-web-deploy-638399803469208326.zip]
maestro-dotnet  aws_s3_object.maestro-lambda-deploy-events (maestro-lambda-deploy-events): Destruction complete after 0s
maestro-dotnet  aws_s3_object.maestro-lambda-deploy-events (maestro-lambda-deploy-events): Creating...
maestro-dotnet  aws_s3_object.maestro-lambda-deploy-web (maestro-lambda-deploy-web): Destruction complete after 0s
maestro-dotnet  aws_s3_object.maestro-lambda-deploy-web (maestro-lambda-deploy-web): Creating...
maestro-dotnet  aws_s3_object.maestro-lambda-deploy-web (maestro-lambda-deploy-web): Creation complete after 1s [id=maestro-web-deploy-638443112933715623.zip]
maestro-dotnet  aws_lambda_function.maestro-web-dotnet (maestro-web-dotnet): Modifying... [id=maestro-web-dotnet-lambda]
maestro-dotnet  aws_s3_object.maestro-lambda-deploy-events (maestro-lambda-deploy-events): Creation complete after 1s [id=maestro-events-deploy-638443112933968027.zip]
maestro-dotnet  aws_lambda_function.maestro-events-dotnet-lambda (maestro-events-dotnet-lambda): Modifying... [id=maestro-event-dotnet-lambda]
maestro-dotnet  aws_lambda_function.maestro-web-dotnet (maestro-web-dotnet): Still modifying... [id=maestro-web-dotnet-lambda, 10s elapsed]
maestro-dotnet  aws_lambda_function.maestro-events-dotnet-lambda (maestro-events-dotnet-lambda): Still modifying... [id=maestro-event-dotnet-lambda, 10s elapsed]
maestro-dotnet  aws_lambda_function.maestro-web-dotnet (maestro-web-dotnet): Modifications complete after 11s [id=maestro-web-dotnet-lambda]
maestro-dotnet  aws_lambda_function.maestro-events-dotnet-lambda (maestro-events-dotnet-lambda): Modifications complete after 12s [id=maestro-event-dotnet-lambda]
maestro-dotnet  Apply complete! Resources: 2 added, 2 changed, 2 destroyed.

No outputs found.

```

</details>